#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
<details><summary>Show Plan</summary>

```
terraform
openstack_compute_secgroup_v2.secgroup: Refreshing state... [id=47779555-2ce1-400c-ba68-d177683c7228]
openstack_networking_floatingip_v2.fip: Refreshing state... [id=1a2e1285-0a20-4582-aab9-27255607a862]
openstack_compute_instance_v2.dashboard: Refreshing state... [id=48ead3fb-4ee5-4806-9181-fa39fc947d9f]
openstack_compute_floatingip_associate_v2.fip: Refreshing state... [id=147.213.76.217/48ead3fb-4ee5-4806-9181-fa39fc947d9f/]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # openstack_networking_floatingip_v2.fip has been changed
  ~ resource "openstack_networking_floatingip_v2" "fip" {
      ~ fixed_ip  = "192.168.10.85" -> "192.168.10.11"
        id        = "1a2e1285-0a20-4582-aab9-27255607a862"
      ~ port_id   = "a807c68b-9010-467c-82f0-49cf0aa74a60" -> "7e67c5d1-d37b-496f-9e19-f377c367027e"
        tags      = []
        # (4 unchanged attributes hidden)
    }
  # openstack_compute_floatingip_associate_v2.fip has been deleted
  - resource "openstack_compute_floatingip_associate_v2" "fip" {
      - floating_ip = "147.213.76.217" -> null
      - id          = "147.213.76.217/48ead3fb-4ee5-4806-9181-fa39fc947d9f/" -> null
      - instance_id = "48ead3fb-4ee5-4806-9181-fa39fc947d9f" -> null
    }
  # openstack_compute_instance_v2.dashboard has been changed
  ~ resource "openstack_compute_instance_v2" "dashboard" {
        id                  = "48ead3fb-4ee5-4806-9181-fa39fc947d9f"
        name                = "dashboard"
      + tags                = []
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_floatingip_associate_v2.fip will be created
  + resource "openstack_compute_floatingip_associate_v2" "fip" {
      + floating_ip = "147.213.76.217"
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
    }

  # openstack_compute_instance_v2.dashboard must be replaced
-/+ resource "openstack_compute_instance_v2" "dashboard" {
      ~ access_ip_v4        = "192.168.10.11" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "m1.medium" -> (known after apply)
      ~ id                  = "48ead3fb-4ee5-4806-9181-fa39fc947d9f" -> (known after apply)
      ~ image_name          = "Ubuntu-20.04-20211006" -> (known after apply)
        name                = "dashboard"
      + region              = (known after apply)
      - tags                = [] -> null
      ~ user_data           = "e5783927810fa151d550730fea0e615020d781e4" -> "d4c8505f3f0b43827f55116a540e6408c4cbcfad" # forces replacement
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.10.11" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:1f:6e:f6" -> (known after apply)
          ~ name           = "private-network" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @enolfc, Action: `pull_request`*